terraform plan:
```
[command]/home/runner/work/_temp/9db78599-344b-40c8-9492-2b3e8e2dd858/terraform-bin plan -no-color
aws_vpc.dev_vpc: Refreshing state... [id=vpc-0e434fc937ec7c46c]
aws_internet_gateway.gw: Refreshing state... [id=igw-0d13bdb32f42b8240]
aws_subnet.dev_us_east_1a: Refreshing state... [id=subnet-031948f8e811d6a18]
aws_instance.dev: Refreshing state... [id=i-02bd28e1ab25583e0]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.dev has been deleted
  - resource "aws_instance" "dev" {
      - ami                                  = "ami-05ad4ed7f9c48178b" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:221354683935:instance/i-02bd28e1ab25583e0" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-02bd28e1ab25583e0" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "Kaveh" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-07cc94c32f85fbe06" -> null
      - private_dns                          = "ip-172-16-10-34.ec2.internal" -> null
      - private_ip                           = "172.16.10.34" -> null
      - public_ip                            = "34.205.127.225" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-031948f8e811d6a18" -> null
      - tags                                 = {
          - "Name" = "dev"
        } -> null
      - tags_all                             = {
          - "Name" = "dev"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-007ae9d2199ea1f25",
          - "sg-09bafcc41daecda49",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0e769defe0b4771e8" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.dev will be created
  + resource "aws_instance" "dev" {
      + ami                                  = "ami-05ad4ed7f9c48178b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "Kaveh"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-031948f8e811d6a18"
      + tags                                 = {
          + "Name" = "dev"
        }
      + tags_all                             = {
          + "Name" = "dev"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-007ae9d2199ea1f25",
          + "sg-09bafcc41daecda49",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ dev_ip = "34.205.127.225" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: aws_vpc.dev_vpc: Refreshing state... [id=vpc-0e434fc937ec7c46c]%0Aaws_internet_gateway.gw: Refreshing state... [id=igw-0d13bdb32f42b8240]%0Aaws_subnet.dev_us_east_1a: Refreshing state... [id=subnet-031948f8e811d6a18]%0Aaws_instance.dev: Refreshing state... [id=i-02bd28e1ab25583e0]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_instance.dev has been deleted%0A  - resource "aws_instance" "dev" {%0A      - ami                                  = "ami-05ad4ed7f9c48178b" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:221354683935:instance/i-02bd28e1ab25583e0" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1a" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 2 -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-02bd28e1ab25583e0" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t3.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "Kaveh" -> null%0A      - monitoring                           = false -> null%0A      - primary_network_interface_id         = "eni-07cc94c32f85fbe06" -> null%0A      - private_dns                          = "ip-172-16-10-34.ec2.internal" -> null%0A      - private_ip                           = "172.16.10.34" -> null%0A      - public_ip                            = "34.205.127.225" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-031948f8e811d6a18" -> null%0A      - tags                                 = {%0A          - "Name" = "dev"%0A        } -> null%0A      - tags_all                             = {%0A          - "Name" = "dev"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-007ae9d2199ea1f25",%0A          - "sg-09bafcc41daecda49",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "unlimited" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0e769defe0b4771e8" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.dev will be created%0A  + resource "aws_instance" "dev" {%0A      + ami                                  = "ami-05ad4ed7f9c48178b"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "Kaveh"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-031948f8e811d6a18"%0A      + tags                                 = {%0A          + "Name" = "dev"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "dev"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + vpc_security_group_ids               = [%0A          + "sg-007ae9d2199ea1f25",%0A          + "sg-09bafcc41daecda49",%0A        ]%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ dev_ip = "34.205.127.225" -> (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::aws_vpc.dev_vpc: Refreshing state... [id=vpc-0e434fc937ec7c46c]%0Aaws_internet_gateway.gw: Refreshing state... [id=igw-0d13bdb32f42b8240]%0Aaws_subnet.dev_us_east_1a: Refreshing state... [id=subnet-031948f8e811d6a18]%0Aaws_instance.dev: Refreshing state... [id=i-02bd28e1ab25583e0]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_instance.dev has been deleted%0A  - resource "aws_instance" "dev" {%0A      - ami                                  = "ami-05ad4ed7f9c48178b" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:221354683935:instance/i-02bd28e1ab25583e0" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1a" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 2 -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-02bd28e1ab25583e0" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t3.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "Kaveh" -> null%0A      - monitoring                           = false -> null%0A      - primary_network_interface_id         = "eni-07cc94c32f85fbe06" -> null%0A      - private_dns                          = "ip-172-16-10-34.ec2.internal" -> null%0A      - private_ip                           = "172.16.10.34" -> null%0A      - public_ip                            = "34.205.127.225" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-031948f8e811d6a18" -> null%0A      - tags                                 = {%0A          - "Name" = "dev"%0A        } -> null%0A      - tags_all                             = {%0A          - "Name" = "dev"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-007ae9d2199ea1f25",%0A          - "sg-09bafcc41daecda49",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "unlimited" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0e769defe0b4771e8" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.dev will be created%0A  + resource "aws_instance" "dev" {%0A      + ami                                  = "ami-05ad4ed7f9c48178b"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "Kaveh"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-031948f8e811d6a18"%0A      + tags                                 = {%0A          + "Name" = "dev"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "dev"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + vpc_security_group_ids               = [%0A          + "sg-007ae9d2199ea1f25",%0A          + "sg-09bafcc41daecda49",%0A        ]%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ dev_ip = "34.205.127.225" -> (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::set-output name=stderr::
::set-output name=exitcode::0

```